codebase/projects/web/test/src/resources/edu/duke/cabig/c3pr/webservice/integration/testdata/InitiateSubjectRegistryRequest.xml

<!--
 Copyright Duke Comprehensive Cancer Center and SemanticBits
   
 Distributed under the OSI-approved BSD 3-Clause License.
 See  https://github.com/NCIP/c3pr/blob/gh-pages/LICENSE.txt for details.
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	 xmlns:uri="uri:iso.org:21090">
	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1"><Assertion xmlns="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" AssertionID="_84a2dba9583195eb43fab0d3abf3f356" IssueInstant="2010-08-09T19:36:59.319Z" Issuer="dkrylov" MajorVersion="1" MinorVersion="1"><AuthenticationStatement AuthenticationInstant="2010-08-09T19:36:59.319Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password"><Subject><NameIdentifier NameQualifier="c3pr">jdoe01</NameIdentifier><SubjectConfirmation><ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key</ConfirmationMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509Data>
<ds:X509Certificate>
MIIDBjCCAsMCBExgWAQwCwYHKoZIzjgEAwUAMGgxDDAKBgNVBAYTA1VTQTELMAkGA1UECBMCVkEx
EDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFudGljMQ8wDQYDVQQLEwZDb2RpbmcxFTAT
BgNVBAMTDERlbmlzIEtyeWxvdjAeFw0xMDA4MDkxOTMzMjRaFw0xMDExMDcxOTMzMjRaMGgxDDAK
BgNVBAYTA1VTQTELMAkGA1UECBMCVkExEDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFu
dGljMQ8wDQYDVQQLEwZDb2RpbmcxFTATBgNVBAMTDERlbmlzIEtyeWxvdjCCAbgwggEsBgcqhkjO
OAQBMIIBHwKBgQD9f1OBHXUSKVLfSpwu7OTn9hG3UjzvRADDHj+AtlEmaUVdQCJR+1k9jVj6v8X1
ujD2y5tVbNeBO4AdNG/yZmC3a5lQpaSfn+gEexAiwk+7qdf+t8Yb+DtX58aophUPBPuD9tPFHsMC
NVQTWhaRMvZ1864rYdcq7/IiAxmd0UgBxwIVAJdgUI8VIwvMspK5gqLrhAvwWBz1AoGBAPfhoIXW
mz3ey7yrXDa4V7l5lK+7+jrqgvlXTAs9B4JnUVlXjrrUWU/mcQcQgYC0SRZxI+hMKBYTt88JMozI
puE8FnqLVHyNKOCjrh4rs6Z1kW6jfwv6ITVi8ftiegEkO8yk8b6oUZCJqIPf4VrlnwaSi2ZegHtV
JWQBTDv+z0kqA4GFAAKBgQDHeWl2X3DU7++f2MUfUKKSd6IAfkMd8/3r4tg5n12BhnqmnIiBX0rE
p47Nsn6bFK4kEEhXggb62Tm+XamuoTocvXRFwFKzJxVDi3O7Qgy1a8gutLSkPtwnoVos2gnoJULX
isk/G8q0fkLHnfrcmPKRh4MHvKQwSGxlMXGJzgW9tDALBgcqhkjOOAQDBQADMAAwLQIUF83BLhDU
gjRXybQuhiDEp9baBjMCFQCBuvPoXWRi3wgYshBzxI0ebaLMiQ==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo></SubjectConfirmation></Subject></AuthenticationStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#dsa-sha1" />
<ds:Reference URI="#_84a2dba9583195eb43fab0d3abf3f356">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="code ds kind rw saml samlp typens #default xsd xsi" /></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
<ds:DigestValue>nyKQmWEfKc+aQnOVfcMeJQOFfI8=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>W5MR1Ia4NUFS1nibEgruQPrDQYRpQlAv7sU+R/a0kR79157nGb1L9Q==</ds:SignatureValue>
<ds:KeyInfo>
<ds:X509Data>
<ds:X509Certificate>
MIIDBjCCAsMCBExgWAQwCwYHKoZIzjgEAwUAMGgxDDAKBgNVBAYTA1VTQTELMAkGA1UECBMCVkEx
EDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFudGljMQ8wDQYDVQQLEwZDb2RpbmcxFTAT
BgNVBAMTDERlbmlzIEtyeWxvdjAeFw0xMDA4MDkxOTMzMjRaFw0xMDExMDcxOTMzMjRaMGgxDDAK
BgNVBAYTA1VTQTELMAkGA1UECBMCVkExEDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFu
dGljMQ8wDQYDVQQLEwZDb2RpbmcxFTATBgNVBAMTDERlbmlzIEtyeWxvdjCCAbgwggEsBgcqhkjO
OAQBMIIBHwKBgQD9f1OBHXUSKVLfSpwu7OTn9hG3UjzvRADDHj+AtlEmaUVdQCJR+1k9jVj6v8X1
ujD2y5tVbNeBO4AdNG/yZmC3a5lQpaSfn+gEexAiwk+7qdf+t8Yb+DtX58aophUPBPuD9tPFHsMC
NVQTWhaRMvZ1864rYdcq7/IiAxmd0UgBxwIVAJdgUI8VIwvMspK5gqLrhAvwWBz1AoGBAPfhoIXW
mz3ey7yrXDa4V7l5lK+7+jrqgvlXTAs9B4JnUVlXjrrUWU/mcQcQgYC0SRZxI+hMKBYTt88JMozI
puE8FnqLVHyNKOCjrh4rs6Z1kW6jfwv6ITVi8ftiegEkO8yk8b6oUZCJqIPf4VrlnwaSi2ZegHtV
JWQBTDv+z0kqA4GFAAKBgQDHeWl2X3DU7++f2MUfUKKSd6IAfkMd8/3r4tg5n12BhnqmnIiBX0rE
p47Nsn6bFK4kEEhXggb62Tm+XamuoTocvXRFwFKzJxVDi3O7Qgy1a8gutLSkPtwnoVos2gnoJULX
isk/G8q0fkLHnfrcmPKRh4MHvKQwSGxlMXGJzgW9tDALBgcqhkjOOAQDBQADMAAwLQIUF83BLhDU
gjRXybQuhiDEp9baBjMCFQCBuvPoXWRi3wgYshBzxI0ebaLMiQ==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo></ds:Signature></Assertion></wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ns5:InitiateSubjectRegistryRequest xmlns:ns2="uri:iso.org:21090"
			xmlns:ns3="http://enterpriseservices.nci.nih.gov"
			xmlns:ns4="http://enterpriseservices.nci.nih.gov/SubjectRegistry"
			xmlns:ns5="http://enterpriseservices.nci.nih.gov/SubjectRegistryService">
			<studySubject>
				<ns4:entity xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
					xsi:type="ns4:Person">
					<ns4:administrativeGenderCode code="Male"/>
					<ns4:birthDate value="19800101000000"/>
					<ns4:biologicEntityIdentifier>
						<ns4:effectiveDateRange nullFlavor="NI"/>
						<ns4:identifier extension="test_subject_id"/>
						<ns4:primaryIndicator value="true"/>
						<ns4:typeCode code="MRN"/>
						<ns4:assigningOrganization>
							<ns4:organizationIdentifier>
								<ns4:identifier extension="MN026"/>
								<ns4:primaryIndicator value="true"/>
								<ns4:typeCode code="CTEP"/>
							</ns4:organizationIdentifier>
						</ns4:assigningOrganization>
					</ns4:biologicEntityIdentifier>
					<ns4:ethnicGroupCode>
						<ns2:item code="Not Reported"/>
					</ns4:ethnicGroupCode>
					<ns4:maritalStatusCode code="Single"/>
					<ns4:name>
						<ns2:item>
							<ns2:part type="GIV" value="John"/>
							<ns2:part type="GIV" value="Z"/>
							<ns2:part type="FAM" value="Doe"/>
						</ns2:item>
					</ns4:name>
					<ns4:postalAddress>
						<ns2:item>
							<ns2:part type="SAL" value="1029 N Stuart St Unit 999"/>
							<ns2:part type="CTY" value="Arlington"/>
							<ns2:part type="STA" value="VA"/>
							<ns2:part type="ZIP" value="22203-5555"/>
							<ns2:part type="CNT" value="USA"/>
						</ns2:item>
					</ns4:postalAddress>
					<ns4:raceCode>
						<ns2:item code="White"/>
						<ns2:item code="Asian"/>
					</ns4:raceCode>
					<ns4:telecomAddress>
						<ns2:item value="mailto:johndoe@semanticbits.com"/>
						<ns2:item value="tel:555-555-5555"/>
						<ns2:item value="x-text-fax:555-555-5555"/>
					</ns4:telecomAddress>
				</ns4:entity>
				<ns4:subjectIdentifier>
					<ns4:identifier extension="test_studysubject_id"/>
					<ns4:primaryIndicator value="true"/>
					<ns4:typeCode code="COORDINATING_CENTER_ASSIGNED_STUDY_SUBJECT_IDENTIFIER"/>
					<ns4:assigningOrganization>
						<ns4:organizationIdentifier>
							<ns4:identifier extension="MN026"/>
							<ns4:primaryIndicator value="true"/>
							<ns4:typeCode code="CTEP"/>
						</ns4:organizationIdentifier>
					</ns4:assigningOrganization>
				</ns4:subjectIdentifier>
				<ns4:paymentMethodCode code="private insurance"/>
				<ns4:statusCode code="Complete"/>
				<ns4:studySubjectProtocolVersion>
					<ns4:studySiteProtocolVersion>
						<ns4:studySite>
							<ns4:organization>
								<ns4:organizationIdentifier>
									<ns4:identifier extension="MN026"/>
									<ns4:primaryIndicator value="true"/>
									<ns4:typeCode code="CTEP"/>
								</ns4:organizationIdentifier>
							</ns4:organization>
						</ns4:studySite>
						<ns4:studyProtocolVersion>
							<ns4:studyProtocolDocument>
								<ns4:officialTitle value="short"/>
								<ns4:document>
									<ns4:documentIdentifier>
										<ns4:identifier extension="test_study_id"/>
										<ns4:primaryIndicator value="true"/>
										<ns4:typeCode code="COORDINATING_CENTER_IDENTIFIER"/>
										<ns4:assigningOrganization>
											<ns4:organizationIdentifier>
												<ns4:identifier extension="MN026"/>
												<ns4:primaryIndicator value="true"/>
												<ns4:typeCode code="CTEP"/>
											</ns4:organizationIdentifier>
										</ns4:assigningOrganization>
									</ns4:documentIdentifier>
								</ns4:document>
								<ns4:publicTitle value="long"/>
								<ns4:publicDescription value="desc"/>
							</ns4:studyProtocolDocument>
						</ns4:studyProtocolVersion>
					</ns4:studySiteProtocolVersion>
					<ns4:studySubjectConsentVersion>
						<ns4:informedConsentDate value="20100101000000"/>
						<ns4:consent>
							<ns4:officialTitle value="General1"/>
							<ns4:versionNumberText value="1.0"/>
						</ns4:consent>
						<ns4:consentDeliveryDate value="20090101000000"/>
						<ns4:consentingMethod code="Written"/>
						<ns4:consentPresenter value="John Doe"/>
						<ns4:subjectConsentAnswer>
							<ns4:missedIndicator value="true"/>
							<ns4:consentQuestion>
								<ns4:officialTitle value="q1"/>
							</ns4:consentQuestion>
						</ns4:subjectConsentAnswer>
						<ns4:subjectConsentAnswer>
							<ns4:missedIndicator value="false"/>
							<ns4:consentQuestion>
								<ns4:officialTitle value="q2"/>
							</ns4:consentQuestion>
						</ns4:subjectConsentAnswer>
					</ns4:studySubjectConsentVersion>
					<ns4:studySubjectConsentVersion>
						<ns4:informedConsentDate value="20080101000000"/>
						<ns4:consent>
							<ns4:officialTitle value="General2"/>
						</ns4:consent>
						<ns4:consentDeliveryDate value="20070101000000"/>
						<ns4:consentingMethod code="Verbal"/>
						<ns4:consentPresenter value="Deepali Sen"/>
						<ns4:subjectConsentAnswer>
							<ns4:missedIndicator value="false"/>
							<ns4:consentQuestion>
								<ns4:officialTitle value="q1"/>
							</ns4:consentQuestion>
						</ns4:subjectConsentAnswer>
						<ns4:subjectConsentAnswer>
							<ns4:missedIndicator value="true"/>
							<ns4:consentQuestion>
								<ns4:officialTitle value="q2"/>
							</ns4:consentQuestion>
						</ns4:subjectConsentAnswer>
					</ns4:studySubjectConsentVersion>
				</ns4:studySubjectProtocolVersion>
			</studySubject>
		</ns5:InitiateSubjectRegistryRequest>
	</soapenv:Body>
</soapenv:Envelope>
